IDEA StatiCa Open Model
BarEndExtendType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of extension of bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum BarEndExtendType
Public Enumeration BarEndExtendType
public enum class BarEndExtendType
Members
Member name | Value | Description
No | 0 |  No extension
ExtendToSegment | 1 |  Extension to the end of segment
ExtendByDistance | 2 |  Extension by distance
See Also
Reference
IdeaRS.OpenModel.Detail Namespace